[
    {
        "category": "burns",
        "content": "General Treatment: Ensure safety by removing the person from the source of the burn. Cool the burn with cool (not cold) running water for 10–20 minutes. Protect the area by removing loose clothing or jewelry but avoid anything stuck to the skin. Type: First-Degree Burn. Symptoms: Redness, Mild swelling, Pain, No blisters. Description: This is a superficial burn that affects only the outer layer of the skin (epidermis). It usually heals within a week without scarring. Treatment: Clean the area gently with cool water, Apply aloe vera gel or a water-based moisturizer, Cover with a sterile, non-stick bandage, Take over-the-counter pain relievers like ibuprofen if needed. Type: Second-Degree Burn. Symptoms: Redness, Swelling, Pain, Blisters. Description: This burn affects both the outer layer of skin (epidermis) and the underlying layer (dermis). It may cause blisters and severe pain and can take weeks to heal. Treatment: Cool the burn with running water, Avoid popping blisters, Apply a thin layer of antibiotic ointment or burn cream, Cover with a non-stick, sterile dressing and change daily, Seek medical attention if necessary. Type: Third-Degree Burn. Symptoms: White, blackened, or charred skin, Numbness due to nerve damage. Description: This is a full-thickness burn that destroys both layers of the skin and may extend into the fat, muscle, or bone. It often requires medical intervention and may result in significant scarring. Treatment: Do not apply water or ointments directly, Cover the burn loosely with a clean, non-stick dressing, Keep the person warm and monitor for shock, Seek emergency medical help immediately."
    },
    {
        "category": "cuts",
        "content": "General Treatment: Stop the bleeding by applying gentle pressure with a clean cloth or bandage. Clean the wound thoroughly with water to remove debris. Apply an antiseptic to prevent infection. Type: Minor Cut. Symptoms: Shallow wound, Minimal bleeding, No exposure of deep tissues. Description: A minor cut is a small wound that only affects the outer layers of the skin. These cuts usually heal quickly with minimal treatment. Treatment: Wash the cut gently with soap and water, Apply an antiseptic or antibiotic cream, Cover with a clean bandage and change it daily. Type: Deep Cut. Symptoms: Profuse bleeding, Visible deeper tissues, Possible jagged edges. Description: A deep cut penetrates the skin and underlying tissues, potentially damaging nerves, blood vessels, or muscles. Treatment: Apply firm pressure with a clean cloth to control bleeding, Clean the wound with water but avoid excessive scrubbing, Cover the wound with a sterile dressing, Seek medical attention if the cut is large, deep, or shows signs of infection. Type: Laceration. Symptoms: Torn or jagged wound edges, Heavy bleeding. Description: Lacerations are irregular, often deeper cuts caused by blunt trauma or sharp objects. They may require stitches or surgical repair. Treatment: Control bleeding by applying direct pressure, Rinse the wound with clean water to remove debris, Cover with a sterile bandage and seek immediate medical care if necessary."
    },
    {
        "category": "bruises",
        "content": "General Treatment: Apply a cold compress or ice pack wrapped in a cloth to the bruised area for 15-20 minutes to reduce swelling. Elevate the bruised area to minimize blood flow and swelling. Rest the affected area to prevent further injury. Type: Minor Bruise. Symptoms: Mild discoloration, Tenderness, Minimal swelling. Description: A minor bruise occurs when small blood vessels break under the skin due to a light impact. It typically heals within a few days. Treatment: Apply a cold compress immediately to reduce swelling, Avoid massaging the area to prevent further damage, Monitor for improvement over the next few days. Type: Deep Bruise. Symptoms: Intense discoloration, Significant pain, Swelling and stiffness. Description: A deep bruise affects tissues beneath the skin and may involve muscles or other structures. It can take longer to heal and might require medical evaluation. Treatment: Use an ice pack to reduce swelling during the first 48 hours, Elevate the area to reduce blood pooling, Take over-the-counter pain relievers if needed, Consult a doctor if the pain or swelling persists. Type: Severe Bruise. Symptoms: Large, dark discoloration, Severe pain, Limited mobility or function. Description: Severe bruises can indicate significant trauma, possibly involving internal bleeding or damage to deeper tissues. Immediate medical attention may be required. Treatment: Seek medical evaluation to rule out internal injuries, Avoid putting pressure on the affected area, Follow medical advice for imaging or further care if necessary."
    },
    {
        "category": "abrasions",
        "content": "General Treatment: Clean the wound gently with mild soap and water to remove dirt and debris. Apply an antiseptic to prevent infection. Cover with a non-stick sterile bandage to protect the area while it heals. Type: Minor Abrasion. Symptoms: Superficial skin damage, Mild redness, Minimal bleeding. Description: A minor abrasion is a surface-level injury that scrapes off the top layer of skin, often caused by a fall or rubbing against a rough surface. Treatment: Wash the area gently with clean water and soap, Apply an antiseptic or antibiotic cream, Cover with a sterile adhesive bandage to protect from infection. Type: Moderate Abrasion. Symptoms: Damage to multiple layers of skin, Mild to moderate bleeding, Pain and tenderness. Description: A moderate abrasion involves deeper damage to the skin layers and may take longer to heal compared to minor abrasions. Treatment: Clean the wound thoroughly to remove debris, Apply an antiseptic to reduce the risk of infection, Cover with a sterile dressing and change it daily until the wound heals. Type: Severe Abrasion. Symptoms: Extensive skin loss, Profuse bleeding, High risk of infection. Description: Severe abrasions are extensive injuries that expose underlying tissues and carry a higher risk of infection and scarring. Treatment: Control bleeding by applying firm pressure with a clean cloth, Avoid scrubbing the wound; rinse gently with clean water, Seek medical attention for advanced wound care and possible antibiotic treatment."
    }
]
